app/controllers/users_controller.rb

  def create
    @user = User.new params.require(:user).permit(:email, :password, :password_confirmation)
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"